//  Это комментарий
console.log("Hello!")  // тоже комментарий

/*
  Это многострочный
 Комментарий
он начинается со /* и заканчивается первым же * /
 */


/**
 Это тот же самый вариант с /*, вторая звездочка на самом деле ничего не значит
 Но у производителей редакторов (как этот webstorm) есть соглашение что это особый комментарий, выделенный цветом
 и обычно такие комментарии используют для документирования кода
 */


/**
 * Вот тут как раз пример такого цветного комментария, это JSDOC
 * его мы пройдем сильно позже
 * @param a
 */
function f(a) {

}