// let
let a = 8;

let b = a / 2; // деление
console.log("b = ", b);
let c = a * 2; // Умножение
console.log("с = ", c);

console.log(a + 1); // Сложение
console.log(a - 1); // Вычитание


console.log(a % 3); // Деление по модулю

// Вообще это как остаток от деления:
// 8 % 3 = 2 и означает что когда делишь 8 на 3 на цело, остаток 2
// Это часто используется для проверки на то, четное ли число
// Например
// 8 % 2 = 0 - число четное
// 9 % 2 = 1 - число нечетное
// 10 % 2 = 0 - число четное
// 11 % 2 = 1 - число нечетное
